In [3]:
import pandas as pd
import numpy as np

# Lendo de um HTML

In [4]:
url = 'https://en.m.wikipedia.org/wiki/UEFA_Champions_League'

html_df = pd.read_html(url,header=0,index_col=0)[3]

In [10]:
html_df

             Titles  Runners-up  Total
Nation
Spain            18          11     29
England          13           9     22
Italy            12          16     28
Germany[A]        7          10     17
Netherlands       6           2      8
Portugal          4           5      9
France            1           5      6
Romania           1           1      2
Scotland          1           1      2
Serbia[B]         1           1      2
Belgium           0           1      1
Greece            0           1      1
Sweden            0           1      1
Totals           64          64    128

In [9]:
html_df['Titles'].value_counts().idxmax()

1     4
0     3
13    1
12    1
64    1
7     1
6     1
4     1
18    1
Name: Titles, dtype: int64

In [11]:
a = html_df.shape

In [13]:
a[0]

3

# Exploração de dados e estatística descritiva

## 1- Look first the number of rows and columns in my data

In [6]:
html_df.shape

(14, 3)

## 2 - Second, you might use .info command to see the types of columns and some other information about the DataFrame

In [7]:
html_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 14 entries, Spain to Totals
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Titles      14 non-null     int64
 1   Runners-up  14 non-null     int64
 2   Total       14 non-null     int64
dtypes: int64(3)
memory usage: 448.0+ bytes

## Some descriptive statistics of your data, look no further than the .describe() method

In [8]:
html_df.describe()

          Titles  Runners-up       Total
count  14.000000   14.000000   14.000000
mean    9.142857    9.142857   18.285714
std    16.796781   16.510403   33.162603
min     0.000000    1.000000    1.000000
25%     1.000000    1.000000    2.000000
50%     2.500000    3.500000    7.000000
75%    10.750000    9.750000   20.750000
max    64.000000   64.000000  128.000000

In [9]:
html_df.head()

             Titles  Runners-up  Total
Nation
Spain            18          11     29
England          13           9     22
Italy            12          16     28
Germany[A]        7          10     17
Netherlands       6           2      8

# Basic Time Series Manipulation with Pandas

In [32]:
import pandas as pd
from datetime import datetime
import numpy as np

date_rng = pd.date_range(start='1/1/2018', end='1/08/2018', freq='H')

In [33]:
date_rng

DatetimeIndex(['2018-01-01 00:00:00', '2018-01-01 01:00:00',
               '2018-01-01 02:00:00', '2018-01-01 03:00:00',
               '2018-01-01 04:00:00', '2018-01-01 05:00:00',
               '2018-01-01 06:00:00', '2018-01-01 07:00:00',
               '2018-01-01 08:00:00', '2018-01-01 09:00:00',
               ...
               '2018-01-07 15:00:00', '2018-01-07 16:00:00',
               '2018-01-07 17:00:00', '2018-01-07 18:00:00',
               '2018-01-07 19:00:00', '2018-01-07 20:00:00',
               '2018-01-07 21:00:00', '2018-01-07 22:00:00',
               '2018-01-07 23:00:00', '2018-01-08 00:00:00'],
              dtype='datetime64[ns]', length=169, freq='H')

## verificando o tipo do primeiro elemento

In [34]:
type(date_rng[0])

pandas._libs.tslibs.timestamps.Timestamp

## Let's create an example data frame with the data and look at the first 15 elemnets

In [35]:
df = pd.DataFrame(date_rng,  columns=['date'])
df['data'] = np.random.randint(0,100,size=(len(date_rng)))

In [36]:
df.head(15)

                  date  data
0  2018-01-01 00:00:00    61
1  2018-01-01 01:00:00    96
2  2018-01-01 02:00:00    98
3  2018-01-01 03:00:00    83
4  2018-01-01 04:00:00    35
5  2018-01-01 05:00:00    80
6  2018-01-01 06:00:00    36
7  2018-01-01 07:00:00    97
8  2018-01-01 08:00:00    73
9  2018-01-01 09:00:00    57
10 2018-01-01 10:00:00    51
11 2018-01-01 11:00:00    43
12 2018-01-01 12:00:00    49
13 2018-01-01 13:00:00    80
14 2018-01-01 14:00:00    54

## Converter the data frame index to datetime index then show the first elements

In [37]:
df['datetime'] = pd.to_datetime(df['date'])
df = df.set_index('datetime')
df.drop(['date'], axis=1, inplace=True)
df.head()

                     data
datetime
2018-01-01 00:00:00    61
2018-01-01 01:00:00    96
2018-01-01 02:00:00    98
2018-01-01 03:00:00    83
2018-01-01 04:00:00    35

## Vamos converter nosso data_rng para uma lista de strings e então converter a string ára timestamps

In [41]:
string_date_rng = [str(x) for x in date_rng]

In [42]:
string_date_rng

['2018-01-01 00:00:00',
 '2018-01-01 01:00:00',
 '2018-01-01 02:00:00',
 '2018-01-01 03:00:00',
 '2018-01-01 04:00:00',
 '2018-01-01 05:00:00',
 '2018-01-01 06:00:00',
 '2018-01-01 07:00:00',
 '2018-01-01 08:00:00',
 '2018-01-01 09:00:00',
 '2018-01-01 10:00:00',
 '2018-01-01 11:00:00',
 '2018-01-01 12:00:00',
 '2018-01-01 13:00:00',
 '2018-01-01 14:00:00',
 '2018-01-01 15:00:00',
 '2018-01-01 16:00:00',
 '2018-01-01 17:00:00',
 '2018-01-01 18:00:00',
 '2018-01-01 19:00:00',
 '2018-01-01 20:00:00',
 '2018-01-01 21:00:00',
 '2018-01-01 22:00:00',
 '2018-01-01 23:00:00',
 '2018-01-02 00:00:00',
 '2018-01-02 01:00:00',
 '2018-01-02 02:00:00',
 '2018-01-02 03:00:00',
 '2018-01-02 04:00:00',
 '2018-01-02 05:00:00',
 '2018-01-02 06:00:00',
 '2018-01-02 07:00:00',
 '2018-01-02 08:00:00',
 '2018-01-02 09:00:00',
 '2018-01-02 10:00:00',
 '2018-01-02 11:00:00',
 '2018-01-02 12:00:00',
 '2018-01-02 13:00:00',
 '2018-01-02 14:00:00',
 '2018-01-02 15:00:00',
 '2018-01-02 16:00:00',
 '2018-01-02 17:00:00',
 '2018-01-02 18:00:00',
 '2018-01-02 19:00:00',
 '2018-01-02 20:00:00',
 '2018-01-02 21:00:00',
 '2018-01-02 22:00:00',
 '2018-01-02 23:00:00',
 '2018-01-03 00:00:00',
 '2018-01-03 01:00:00',
 '2018-01-03 02:00:00',
 '2018-01-03 03:00:00',
 '2018-01-03 04:00:00',
 '2018-01-03 05:00:00',
 '2018-01-03 06:00:00',
 '2018-01-03 07:00:00',
 '2018-01-03 08:00:00',
 '2018-01-03 09:00:00',
 '2018-01-03 10:00:00',
 '2018-01-03 11:00:00',
 '2018-01-03 12:00:00',
 '2018-01-03 13:00:00',
 '2018-01-03 14:00:00',
 '2018-01-03 15:00:00',
 '2018-01-03 16:00:00',
 '2018-01-03 17:00:00',
 '2018-01-03 18:00:00',
 '2018-01-03 19:00:00',
 '2018-01-03 20:00:00',
 '2018-01-03 21:00:00',
 '2018-01-03 22:00:00',
 '2018-01-03 23:00:00',
 '2018-01-04 00:00:00',
 '2018-01-04 01:00:00',
 '2018-01-04 02:00:00',
 '2018-01-04 03:00:00',
 '2018-01-04 04:00:00',
 '2018-01-04 05:00:00',
 '2018-01-04 06:00:00',
 '2018-01-04 07:00:00',
 '2018-01-04 08:00:00',
 '2018-01-04 09:00:00',
 '2018-01-04 10:00:00',
 '2018-01-04 11:00:00',
 '2018-01-04 12:00:00',
 '2018-01-04 13:00:00',
 '2018-01-04 14:00:00',
 '2018-01-04 15:00:00',
 '2018-01-04 16:00:00',
 '2018-01-04 17:00:00',
 '2018-01-04 18:00:00',
 '2018-01-04 19:00:00',
 '2018-01-04 20:00:00',
 '2018-01-04 21:00:00',
 '2018-01-04 22:00:00',
 '2018-01-04 23:00:00',
 '2018-01-05 00:00:00',
 '2018-01-05 01:00:00',
 '2018-01-05 02:00:00',
 '2018-01-05 03:00:00',
 '2018-01-05 04:00:00',
 '2018-01-05 05:00:00',
 '2018-01-05 06:00:00',
 '2018-01-05 07:00:00',
 '2018-01-05 08:00:00',
 '2018-01-05 09:00:00',
 '2018-01-05 10:00:00',
 '2018-01-05 11:00:00',
 '2018-01-05 12:00:00',
 '2018-01-05 13:00:00',
 '2018-01-05 14:00:00',
 '2018-01-05 15:00:00',
 '2018-01-05 16:00:00',
 '2018-01-05 17:00:00',
 '2018-01-05 18:00:00',
 '2018-01-05 19:00:00',
 '2018-01-05 20:00:00',
 '2018-01-05 21:00:00',
 '2018-01-05 22:00:00',
 '2018-01-05 23:00:00',
 '2018-01-06 00:00:00',
 '2018-01-06 01:00:00',
 '2018-01-06 02:00:00',
 '2018-01-06 03:00:00',
 '2018-01-06 04:00:00',
 '2018-01-06 05:00:00',
 '2018-01-06 06:00:00',
 '2018-01-06 07:00:00',
 '2018-01-06 08:00:00',
 '2018-01-06 09:00:00',
 '2018-01-06 10:00:00',
 '2018-01-06 11:00:00',
 '2018-01-06 12:00:00',
 '2018-01-06 13:00:00',
 '2018-01-06 14:00:00',
 '2018-01-06 15:00:00',
 '2018-01-06 16:00:00',
 '2018-01-06 17:00:00',
 '2018-01-06 18:00:00',
 '2018-01-06 19:00:00',
 '2018-01-06 20:00:00',
 '2018-01-06 21:00:00',
 '2018-01-06 22:00:00',
 '2018-01-06 23:00:00',
 '2018-01-07 00:00:00',
 '2018-01-07 01:00:00',
 '2018-01-07 02:00:00',
 '2018-01-07 03:00:00',
 '2018-01-07 04:00:00',
 '2018-01-07 05:00:00',
 '2018-01-07 06:00:00',
 '2018-01-07 07:00:00',
 '2018-01-07 08:00:00',
 '2018-01-07 09:00:00',
 '2018-01-07 10:00:00',
 '2018-01-07 11:00:00',
 '2018-01-07 12:00:00',
 '2018-01-07 13:00:00',
 '2018-01-07 14:00:00',
 '2018-01-07 15:00:00',
 '2018-01-07 16:00:00',
 '2018-01-07 17:00:00',
 '2018-01-07 18:00:00',
 '2018-01-07 19:00:00',
 '2018-01-07 20:00:00',
 '2018-01-07 21:00:00',
 '2018-01-07 22:00:00',
 '2018-01-07 23:00:00',
 '2018-01-08 00:00:00']

In [43]:
timestamp_date_rng = pd.to_datetime(string_date_rng, infer_datetime_format=True)
timestamp_date_rng

DatetimeIndex(['2018-01-01 00:00:00', '2018-01-01 01:00:00',
               '2018-01-01 02:00:00', '2018-01-01 03:00:00',
               '2018-01-01 04:00:00', '2018-01-01 05:00:00',
               '2018-01-01 06:00:00', '2018-01-01 07:00:00',
               '2018-01-01 08:00:00', '2018-01-01 09:00:00',
               ...
               '2018-01-07 15:00:00', '2018-01-07 16:00:00',
               '2018-01-07 17:00:00', '2018-01-07 18:00:00',
               '2018-01-07 19:00:00', '2018-01-07 20:00:00',
               '2018-01-07 21:00:00', '2018-01-07 22:00:00',
               '2018-01-07 23:00:00', '2018-01-08 00:00:00'],
              dtype='datetime64[ns]', length=169, freq=None)